# George Westinghouse CTE High School: **Computer Science Department**

Course: **Intro to Data Science in Python**

# **Lab 1F - Zooming Through Data**

The first step for our analysis is to import our libraries

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

The next step is to import our dataset and assign it to a variable called **cdc**

In [0]:
#load the data and assign it to the variable cdc
atu_dirty = pd.read_csv("https://raw.githubusercontent.com/nschettini/datasets/master/atu_dirty.csv")

# **Messy data? Get used to it**

* Since lab 1, the data we've been using has been pretty clean.
* Why do we call it clean?
 * Variables were named so we could understand what they were about.
 * There didn't seem to be any typos in the values.
 * Numerical variables were considered numbers.
 * Categorical variables were composed of categories.
* Unfortunately, more often than not, data is messy until YOU clean it.
* In this lab, we'll learn a few essentials for cleaning dirty data.

# **Messy data?**

* What do we mean by messy data?
* Variables might have non-descriptive names
 * Var01, V2, a, ...
* Categorical variables might have misspelled categories
 * "blue", "Blue", "blu", ...
* Numerical variables might have been input incorrectly. For example, if we're talk about people's height in inches:
 * 64.7, 6.86, 676, ...
* Numerical variables might be incorrectly coded as categorical variables (Or vice-versa)
 * "64.7", "68.6", "67.6"

# **The American Time Use Survey**

* To show you what dirty data looks like, we'll check out the American Time Use Survey, or ATU survey.
* What is ATU survey?
 * It's a survey conducted by the US government (Specifically the Bureau of Labor Statistics).
* They survey thousands of people to find out exactly what activities they do throughout a single day.
* These thousands of people combined together give an idea about how much time the typical person living in the US spends doing various activites.

**What is messy data? Give an example of messy data.**

Messy data is .... .  An example of messy data is ...

# **Load and go:**

**Type** the following commands into your cell below.  **Don't copy and paste.**

`atu_dirty.head()`

**Just by viewing the data, what parts of our ATU data do you think need cleaning?** 

Based on viewing only the data, I think the parts of the ATU data that need to be cleaned are ...

In [0]:
atu_dirty.head()

   Unnamed: 0          caseid  V1  V2         V3  V4   V5  V6   V7
0           1  20160101160045  62   2  No answer   1  690   0  465
1           2  20160101160066  69   1  No answer   2  600   0  560
2           3  20160101160069  24   2  No answer   1  940   0   20
3           4  20160101160083  31   2  Part time   1  635   0  120
4           5  20160101160084  59   2  Part time   1  500   0  177

# **Description of ATU Variables**

* The description of the actual variables:|

 * caseid: Anonymous ID of survey taker.
 * V1: The age of the respondent.
 * V2: The gender of the respondent.
 * V3: Whether the person is employed full-time or part-time.
 * V4: Whether the person has a physical difficulty.
 * V5: How long the person sleeps, in minutes.
 * V6: How long the survey taker spent on homework, in minutes.
 * V7: How long the respondent spent socializing, in minutes.

# **New name, same old data**

* To fix the variable names, we need to assign a new set of names in place of the old ones.
 * Below is an example of the rename function:


---
` variable_name.rename(columns={'old_name': 'new_name', 'old_name':'new_name'})`
---

Use the example code and the variable information above to rename the rest of the variables in atu_dirty.  Save your updated dataset to a new variable, **atu_clean**.  atu_clean = variable_name.rename(columns.....)

 * Names should be short, contain no spaces and describe what the variable is related to. So use abbreviations to your heart's content.

In [0]:
atu_dirty.rename(columns={'V1':'Age','V2':'Gender','V3':'Employment','V4':'Phys_disablity','V5':'Sleep_time','V6':'Homework_time','V7':'Socializing'})

       Unnamed: 0          caseid  Age  ...  Sleep_time Homework_time  Socializing
0               1  20160101160045   62  ...         690             0          465
1               2  20160101160066   69  ...         600             0          560
2               3  20160101160069   24  ...         940             0           20
3               4  20160101160083   31  ...         635             0          120
4               5  20160101160084   59  ...         500             0          177
...           ...             ...  ...  ...         ...           ...          ...
10488       10489  20161212162307   52  ...         520             0          585
10489       10490  20161212162357   69  ...         645             0          625
10490       10491  20161212162426   28  ...         402             0           20
10491       10492  20161212162456   80  ...         420             0          979
10492       10493  20161212162509   16  ...         910             0          430

[10493 rows x 9 columns]

**Now that you've modified the column names, call your dataset and see what all your hard work has done!**

variable_name.head(3)

In [0]:
atu_dirty.head(3)

   Unnamed: 0          caseid  Age  ...  Sleep_time Homework_time  Socializing
0           1  20160101160045   62  ...         690             0          465
1           2  20160101160066   69  ...         600             0          560
2           3  20160101160069   24  ...         940             0           20

[3 rows x 9 columns]

**What happened?** 

The thing that happened is I called the variable atu_cleanand it showed the updated variables name that I entered

Copy and paste the code you TYPED into the green below.  This time, add a "**,inplace=True**" command after the last "}".  **Now what happens?  What does inplace=True do?**

In [0]:
atu_dirty.rename(columns={'V1':'Age','V2':'Gender','V3':'Employment','V4':'Phys_disablity','V5':'Sleep_time','V6':'Homework_time','V7':'Socializing'},
                 inplace=True)

#**Next up: Strings**

* In programming, a string is sort of like a word.
 * It's a value made up of characters (i.e. letters)
* The following are example of strings. Notice that each string has quotes before and after.



```
"string"
"A1B2c3"
"Hot Cocoa"
"0015"
```

# **Numbers are words? (Sometimes)**

* In some cases, Python will treat values that look like numbers as if they were strings.
* Sometimes we do this on purpose.
 * For example, we can code Yes/No variables as "1"/"0".
* Sometimes we don't mean for this to happen.
 * The number of siblings a person has should not be a string.
* Look at the structure of your data and the variable descriptions from above
 * **Write down the variables that should be numeric but are improperly coded as
strings or characters.**  You can also use the variable.info() command.

# **Changing strings into numbers**

* To fix this problem, we need to tell Python to think of our numeric variables as numeric variables.
* We can do this with the as.numeric function.
 * An example using this function is below:

` pd.to_numeric("3.14")`

Notice: We started with a string, "3.14", but to_numeric() was able to turn it back into a number.

# **Mutating in action**

* Look at the variables you thought should be numeric and select one. Then fill in the blanks below to see how we can correctly code it as a number:

The best way to convert one or more columns of a DataFrame to numeric values is to use **pd.to_numeric()**.

This function will try to change non-numeric objects (such as strings) into integers or floating point numbers as appropriate.


---
`pd.to_numeric(atu_dirty['___'])`
---
---
Convert one of the variables that should be numeric into numeric using the pd.to_numeric() function

In [0]:
pd.to_numeric(atu_dirty['Age'])

0        62
1        69
2        24
3        31
4        59
         ..
10488    52
10489    69
10490    28
10491    80
10492    16
Name: Age, Length: 10493, dtype: int64

# **Deciphering Categorical Variables**

* We mentioned earlier that we sometimes code categorical variables as numbers.
 * For example, our gender variable uses "01" and "02" for "Male" and "Female",
respectively.

* It's often much easier to analyze and interpret when we use more descriptive categories, such as
 * "Male" and "Female".

# **Factors and Levels**

* Python has a special name for categorical variables, called factors.
* Python also has a special name for the different categories of a categorical variable.
 * The individual categories are called levels.

* To see the levels of employment type:

`atu_dirty['V3'].unique()`

* **Use similar code as we used above to write down the levels for the three other factors in our data.**

In [0]:
atu_dirty['Age'].unique()

array([62, 69, 24, 31, 59, 16, 43, 34, 63, 39, 35, 54, 40, 19, 76, 65, 70,
       68, 36, 45, 50, 52, 26, 25, 74, 32, 22, 46, 17, 44, 53, 29, 58, 27,
       56, 85, 75, 47, 18, 30, 20, 51, 49, 33, 37, 66, 61, 80, 73, 67, 48,
       21, 55, 64, 60, 23, 57, 72, 41, 77, 42, 79, 28, 15, 71, 78, 38])

# **A level by any other name...**

* If we know that '1' means 'Male' and '2' means 'Female' then we can use the following code to recode the levels of gender.
* Type the following command into your console:

`atu_dirty['___'].replace(2, 'Female',inplace=True)`


This code is saying:

* Replace my current version of atu_clean..
* with a mutated one where ...
* the gender variable's levels ...
* have been recoded..."
* where "1" will now be "Male"...
* and "2" will now be "Female".

**Recode your gender variables to say Male and Female, rather than 1 and 2.**

In [0]:
atu_dirty['Age'].replace(1, 'Male', inplace=True)

In [0]:
atu_dirty['Age'].replace(2, 'Female', inplace=True)

**Record the categorical variable about wheather the person surveyed had aphysical challenge or not.**  The coding is currently: 

 * "1": Person surveyed did not have a physical challenge.
 * "2": Person surveyed did have a physical challenge.

In [0]:
atu_dirty['Phys_disablity'].replace(1, 'Male', inplace=True)

In [0]:
atu_dirty['Phys_disablity'].replace(2, 'Female', inplace=True)

# **Finish it!**

**Call your cleaned dataset.  Check to see if your variables are correct and "Clean".**

In [0]:
atu_dirty

       Unnamed: 0          caseid  Age  ...  Sleep_time Homework_time Socializing
0               1  20160101160045   62  ...         690             0         465
1               2  20160101160066   69  ...         600             0         560
2               3  20160101160069   24  ...         940             0          20
3               4  20160101160083   31  ...         635             0         120
4               5  20160101160084   59  ...         500             0         177
...           ...             ...  ...  ...         ...           ...         ...
10488       10489  20161212162307   52  ...         520             0         585
10489       10490  20161212162357   69  ...         645             0         625
10490       10491  20161212162426   28  ...         402             0          20
10491       10492  20161212162456   80  ...         420             0         979
10492       10493  20161212162509   16  ...         910             0         430

[10493 rows x 9 columns]